In [2]:
import os
import json

import pandas as pd
import numpy as np

In [3]:
import os

raw_data = []
for filename in os.listdir('./data/return-data'):
    if filename.endswith(".txt"):
        with open('./data/return-data/' + filename, 'r') as file:
            for row in file:
                line = json.loads(row)
                raw_data.append(line)

In [4]:
df = pd.DataFrame.from_dict(raw_data)

In [5]:
df.basket.values

array([list([4, 5, 4, 5]), list([0, 4]), list([5]), ..., list([5, 1]),
       list([3, 1, 4]), list([0])], dtype=object)

In [6]:
df['num_items'] = df.basket.apply(lambda row: len(row))

In [7]:
def count_items_from_category(lst, category_num):
    return sum(i for i in lst if i == category_num)

In [8]:
for i in range(0,6):
    df['category_'+str(i)] = df.basket.apply(lambda row: sum(1 for j in row if j==i))

In [9]:
df.drop(columns=['basket'], inplace=True)

In [10]:
df.head()

,transactionId,zipCode,totalAmount,returnLabel,num_items,category_0,category_1,category_2,category_3,category_4,category_5
0,8890718651,2092,60,0,4,0,0,0,0,2,2
1,2942336193,1378,72,0,2,1,0,0,0,1,0
2,3803371043,5674,16,0,1,0,0,0,0,0,1
3,2900339966,7843,20,0,2,0,0,1,1,0,0
4,4995932622,3201,114,0,3,1,0,1,1,0,0

In [11]:
df.shape

(31000, 11)

In [12]:
df.transactionId.nunique()

31000

In [13]:
df.drop(columns=['transactionId'], inplace=True)

In [14]:
df.head()

,zipCode,totalAmount,returnLabel,num_items,category_0,category_1,category_2,category_3,category_4,category_5
0,2092,60,0,4,0,0,0,0,2,2
1,1378,72,0,2,1,0,0,0,1,0
2,5674,16,0,1,0,0,0,0,0,1
3,7843,20,0,2,0,0,1,1,0,0
4,3201,114,0,3,1,0,1,1,0,0

In [15]:
df = df[['returnLabel','zipCode', 'totalAmount', 'category_0',
       'category_1', 'category_2', 'category_3', 'category_4', 'category_5']]

In [16]:
dummy = pd.get_dummies(df.zipCode)

In [17]:
df = df.merge(dummy, how='inner', left_index=True, right_index=True).drop(columns='zipCode')

In [18]:
df.head()

,returnLabel,totalAmount,category_0,category_1,category_2,category_3,category_4,category_5,1000,1001,...,17409,17721,18152,18208,18558,18683,18756,19454,19520,19587
0,0,60,0,0,0,0,2,2,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,72,1,0,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,16,0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,20,0,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,114,1,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [19]:
df.to_csv('./data/test.csv', index=False)